Documents/упКорректировкаОстатковМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упКорректировкаОстатковМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГСМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Запчасти</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Запчасть</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упЗапчасти</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/упМетодыОценкиСтоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упМетодыОценкиСтоимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФИФО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упКорректировкаОстатковМатериалов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Процедура заполнения дополнительных свойст документа.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упГСМ.ГСМ КАК Материал,
	|	СУММА(упГСМ.Количество) КАК Количество,
	|	СУММА(упГСМ.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(упГСМ.СуммаСНДС) КАК СуммаСНДС
	|ПОМЕСТИТЬ втМатериалы
	|ИЗ
	|	Документ.упКорректировкаОстатковМатериалов.ГСМ КАК упГСМ
	|ГДЕ
	|	упГСМ.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	упГСМ.ГСМ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упЗапчасти.Запчасть,
	|	СУММА(упЗапчасти.Количество),
	|	СУММА(упЗапчасти.СуммаБезНДС),
	|	СУММА(упЗапчасти.СуммаСНДС)
	|ИЗ
	|	Документ.упКорректировкаОстатковМатериалов.Запчасти КАК упЗапчасти
	|ГДЕ
	|	упЗапчасти.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	упЗапчасти.Запчасть
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	упКорректировкаОстатковМатериалов.Склад КАК Склад,
	|	&Партия КАК Партия,
	|	втМатериалы.Материал,
	|	втМатериалы.Количество,
	|	втМатериалы.СуммаБезНДС,
	|	втМатериалы.СуммаСНДС
	|ИЗ
	|	втМатериалы КАК втМатериалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упКорректировкаОстатковМатериалов КАК упКорректировкаОстатковМатериалов
	|		ПО (упКорректировкаОстатковМатериалов.Ссылка = &Ссылка)";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Партия", ?(ДополнительныеСвойства.МетодОценки = Перечисления.упМетодыОценкиСтоимости.ФИФО, ДокументСсылка, документы.упКорректировкаОстатковМатериалов.ПустаяСсылка()));
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		ОстаткиМатериалов = Новый ТаблицаЗначений;
		ОстаткиМатериалов.Колонки.Добавить("ВидДвижения");
		ОстаткиМатериалов.Колонки.Добавить("Склад"      , Новый ОписаниеТипов("СправочникСсылка.упСклады"));
		ОстаткиМатериалов.Колонки.Добавить("Материал"   , Новый ОписаниеТипов("СправочникСсылка.упГСМ, СправочникСсылка.упЗапчасти"));
		ОстаткиМатериалов.Колонки.Добавить("Партия"     , Новый ОписаниеТипов("ДокументСсылка.упПоступлениеМатериалов, ДокументСсылка.упКорректировкаОстатковМатериалов"));
		ОстаткиМатериалов.Колонки.Добавить("Количество" , Новый ОписаниеТипов("Число"));
		ОстаткиМатериалов.Колонки.Добавить("СуммаБезНДС", Новый ОписаниеТипов("Число"));
		ОстаткиМатериалов.Колонки.Добавить("СуммаСНДС"  , Новый ОписаниеТипов("Число"));
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОстаткиМатериалов.Добавить(), Выборка);
		КонецЦикла;
		ДополнительныеСвойства.Вставить("ОстаткиМатериалов", ОстаткиМатериалов);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
